In [4]:
#索引,選取
import numpy as np
import pandas as pd
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [5]:
obj['a']

0.0

In [6]:
obj[0]

0.0

In [7]:
#slice
obj[['a','b','c']]

a    0.0
b    1.0
c    2.0
dtype: float64

In [8]:
obj[0:3]

a    0.0
b    1.0
c    2.0
dtype: float64

In [12]:
#過濾
obj[obj<2]

a    0.0
b    1.0
dtype: float64

In [13]:
#DataFrame
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                   index=['台北','台中','台南', '高雄'],
                   columns=['one', 'two', 'three', 'four'])
data

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

In [17]:
#dataFrame[],欄位
data['one']

台北     0
台中     4
台南     8
高雄    12
Name: one, dtype: int64

In [20]:
data[['one', 'two']]

    one  two
台北    0    1
台中    4    5
台南    8    9
高雄   12   13

In [21]:
data.loc[['台北','台中']]

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7

In [22]:
data.iloc[:3]

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
台南    8    9     10    11